{"question_id": "2136", "problem_slug": "find-cutoff-score-for-each-school", "problem_title": "Find Cutoff Score for Each School", "content": "Table: Schools\n\n+-------------+------+\n| Column Name | Type |\n+-------------+------+\n| school_id   | int  |\n| capacity    | int  |\n+-------------+------+\nschool_id is the column with unique values for this table.\nThis table contains information about the capacity of some schools. The capacity is the maximum number of students the school can accept.\n\n \nTable: Exam\n\n+---------------+------+\n| Column Name   | Type |\n+---------------+------+\n| score         | int  |\n| student_count | int  |\n+---------------+------+\nscore is the column with unique values for this table.\nEach row in this table indicates that there are student_count students that got at least score points in the exam.\nThe data in this table will be logically correct, meaning a row recording a higher score will have the same or smaller student_count compared to a row recording a lower score. More formally, for every two rows i and j in the table, if scorei > scorej then student_counti <= student_countj.\n\n \nEvery year, each school announces a minimum score requirement that a student needs to apply to it. The school chooses the minimum score requirement based on the exam results of all the students:\n\nThey want to ensure that even if every student meeting the requirement applies, the school can accept everyone.\nThey also want to maximize the possible number of students that can apply.\nThey must use a score that is in the Exam table.\n\nWrite a solution to report the minimum score requirement for each school. If there are multiple score values satisfying the above conditions, choose the smallest one. If the input data is not enough to determine the score, report -1.\nReturn the result table in any order.\nThe result format is in the following example.\n \nExample 1:\n\nInput:\nSchools table:\n+-----------+----------+\n| school_id | capacity |\n+-----------+----------+\n| 11        | 151      |\n| 5         | 48       |\n| 9         | 9        |\n| 10        | 99       |\n+-----------+----------+\nExam table:\n+-------+---------------+\n| score | student_count |\n+-------+---------------+\n| 975   | 10            |\n| 966   | 60            |\n| 844   | 76            |\n| 749   | 76            |\n| 744   | 100           |\n+-------+---------------+\nOutput:\n+-----------+-------+\n| school_id | score |\n+-----------+-------+\n| 5         | 975   |\n| 9         | -1    |\n| 10        | 749   |\n| 11        | 744   |\n+-----------+-------+\nExplanation: \n- School 5: The school's capacity is 48. Choosing 975 as the min score requirement, the school will get at most 10 applications, which is within capacity.\n- School 10: The school's capacity is 99. Choosing 844 or 749 as the min score requirement, the school will get at most 76 applications, which is within capacity. We choose the smallest of them, which is 749.\n- School 11: The school's capacity is 151. Choosing 744 as the min score requirement, the school will get at most 100 applications, which is within capacity.\n- School 9: The data given is not enough to determine the min score requirement. Choosing 975 as the min score, the school may get 10 requests while its capacity is 9. We do not have information about higher scores, hence we report -1.\n\n", "hints": [], "exampleTestcases": "{\"headers\":{\"Schools\":[\"school_id\",\"capacity\"],\"Exam\":[\"score\",\"student_count\"]},\"rows\":{\"Schools\":[[11,151],[5,48],[9,9],[10,99]],\"Exam\":[[975,10],[966,60],[844,76],[749,76],[744,100]]}}", "codeSnippets": {"MySQL": {"langSlug": "mysql", "code": "# Write your MySQL query statement below\n"}, "MS SQL Server": {"langSlug": "mssql", "code": "/* Write your T-SQL query statement below */\n"}, "Oracle": {"langSlug": "oraclesql", "code": "/* Write your PL/SQL query statement below */\n"}, "Pandas": {"langSlug": "pythondata", "code": "import pandas as pd\n\ndef find_cutoff_score(schools: pd.DataFrame, exam: pd.DataFrame) -> pd.DataFrame:\n    "}, "PostgreSQL": {"langSlug": "postgresql", "code": "-- Write your PostgreSQL query statement below\n"}}}